#include<stdio.h>
int main(void) {
    int a,b,c,d,e;
    float ans1,ans2,ans3;
    scanf("%d",&a);
    scanf("%d",&b);
    scanf("%d",&c);
    scanf("%d",&d);
    scanf("%d",&e);
    ans1 = 0.08*a+0.1393*b+0.1349*c+1.1287*d+1.4803*e;
    ans2 = 0.07*a+0.1304*b+0.1217*c+1.1127*d+1.2458*e;
    ans3 = 0.06*a+0.1087*b+0.1018*c+0.9572*d+1.1243*e;
    if (ans1<183) ans1 = 183;
    if (ans2<383) ans2 = 383;
    if (ans3<983) ans3 = 983;
    if (ans1<ans2 && ans1<ans3) printf("183");
    else if (ans2<ans1 && ans2<ans3) printf("383");
    else if (ans3<ans1 && ans3<ans2) printf("983");
}

// 006
// 輸入每月網內、網外、市話、通話時間(sec)及網內、網外 簡訊則數，求最佳資費。
// 費率如下表：
// *月租費也要納入考量
// 資費類型 183型 383型 983型
// 月租費 183元 383元 983元
// 優惠內容 月租費可抵等額通信費
// 語音 網內 0.08 0.07 0.06
// (元/秒) 網外 0.1393 0.1304 0.1087
// 市話(元/秒) 0.1349 0.1217 0.1018
// 簡訊 網內 1.1287 1.1127 0.9572
// (元/則) 網外 1.4803 1.2458 1.1243

// 輸入 網內語音(sec)、網外語音(sec)、市話(sec)、網內簡訊數、網外簡訊數 測試資料。

// Sample Input：
// 500
// 120
// 13
// 2
// 5

// Sample Output：
// 183

// Sample Input：
// 200
// 200
// 200
// 200
// 200

// Sample Output：
// 383


